spec/fixtures/vcr_cassettes/go_cardless_successful_subscription.yml

---
http_interactions:
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/mandates/MD0000PSV8N7FR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 14 Jun 2016 23:43:04 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=debea609b71e504cd05f4f429b7657d8d1465947784; expires=Wed, 14-Jun-17
        23:43:04 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"66282fd01510f62e34680e90febc7e91"
      X-Request-Id:
      - 2e92d890-adde-4224-bed1-210b626807d7
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '999'
      Ratelimit-Reset:
      - Tue, 14 Jun 2016 23:44:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2b31a4722e233590-LHR
    body:
      encoding: ASCII-8BIT
      string: '{"mandates":{"id":"MD0000PSV8N7FR","created_at":"2016-04-11T19:16:56.421Z","reference":"OMAR-JMEKNM53MREX3","status":"active","scheme":"bacs","next_possible_charge_date":"2016-06-20","payments_require_approval":false,"metadata":{},"links":{"customer_bank_account":"BA0000P8MREF5F","creditor":"CR000045KKQEY8"}}}'
    http_version: 
  recorded_at: Tue, 14 Jun 2016 23:43:04 GMT
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/customer_bank_accounts/BA0000P8MREF5F
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 14 Jun 2016 23:43:05 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d0485df7949603a01ac61e23f86e4d0e61465947785; expires=Wed, 14-Jun-17
        23:43:05 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"2c73e1d569064ff106e2377ed61d5700"
      X-Request-Id:
      - 5b390f34-a392-48a3-b300-5a2c51c40c4b
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '998'
      Ratelimit-Reset:
      - Tue, 14 Jun 2016 23:44:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2b31a478968f34be-LHR
    body:
      encoding: ASCII-8BIT
      string: '{"customer_bank_accounts":{"id":"BA0000P8MREF5F","created_at":"2016-04-11T19:16:56.376Z","account_number_ending":"11","account_holder_name":"S
        SAMWELL","bank_name":"BARCLAYS BANK PLC","currency":"GBP","country_code":"GB","metadata":{},"enabled":true,"links":{"customer":"CU0000RR39FMVB"}}}'
    http_version: 
  recorded_at: Tue, 14 Jun 2016 23:43:05 GMT
- request:
    method: post
    uri: https://api-sandbox.gocardless.com/subscriptions
    body:
      encoding: UTF-8
      string: '{"subscriptions":{"amount":1155,"currency":"GBP","links":{"mandate":"MD0000PSV8N7FR"},"metadata":{"customer_id":"CU0000RR39FMVB"},"name":"donation","interval_unit":"monthly","start_date":"2016-06-20"}}'
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 14 Jun 2016 23:43:06 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d9a723d39341c1322dd6ea1ad465157221465947786; expires=Wed, 14-Jun-17
        23:43:06 GMT; path=/; domain=.gocardless.com; HttpOnly
      Location:
      - https://api-sandbox.gocardless.com/subscriptions/SB0000370YF1ZG
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"fc2a4f669d3b8cc1d6c4acbcb4c24014"
      X-Request-Id:
      - 6bddde5b-3e9e-462c-9f4e-230362c374f4
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '997'
      Ratelimit-Reset:
      - Tue, 14 Jun 2016 23:44:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2b31a4823725139b-LHR
    body:
      encoding: UTF-8
      string: '{"subscriptions":{"id":"SB0000370YF1ZG","created_at":"2016-06-14T23:43:06.680Z","amount":1155,"currency":"GBP","status":"active","name":"donation","start_date":"2016-06-20","end_date":null,"interval":1,"interval_unit":"monthly","day_of_month":null,"month":null,"metadata":{"customer_id":"CU0000RR39FMVB"},"payment_reference":null,"upcoming_payments":[{"charge_date":"2016-06-20","amount":1155},{"charge_date":"2016-07-20","amount":1155},{"charge_date":"2016-08-22","amount":1155},{"charge_date":"2016-09-20","amount":1155},{"charge_date":"2016-10-20","amount":1155},{"charge_date":"2016-11-21","amount":1155},{"charge_date":"2016-12-20","amount":1155},{"charge_date":"2017-01-20","amount":1155},{"charge_date":"2017-02-20","amount":1155},{"charge_date":"2017-03-20","amount":1155}],"links":{"mandate":"MD0000PSV8N7FR"}}}'
    http_version: 
  recorded_at: Tue, 14 Jun 2016 23:43:06 GMT
recorded_with: VCR 3.0.0
