spec/fixtures/vcr_cassettes/go_cardless_successful_transaction.yml

---
http_interactions:
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/mandates/MD0000PSV8N7FR
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 14 Jun 2016 23:49:51 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d3ebade908f85c03ed2f26b14ec5ad2901465948191; expires=Wed, 14-Jun-17
        23:49:51 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"66282fd01510f62e34680e90febc7e91"
      X-Request-Id:
      - c9a066b9-7635-4ba5-81fb-53f9c6438c2e
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '999'
      Ratelimit-Reset:
      - Tue, 14 Jun 2016 23:50:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2b31ae64284634be-LHR
    body:
      encoding: ASCII-8BIT
      string: '{"mandates":{"id":"MD0000PSV8N7FR","created_at":"2016-04-11T19:16:56.421Z","reference":"OMAR-JMEKNM53MREX3","status":"active","scheme":"bacs","next_possible_charge_date":"2016-06-20","payments_require_approval":false,"metadata":{},"links":{"customer_bank_account":"BA0000P8MREF5F","creditor":"CR000045KKQEY8"}}}'
    http_version: 
  recorded_at: Tue, 14 Jun 2016 23:49:51 GMT
- request:
    method: post
    uri: https://api-sandbox.gocardless.com/payments
    body:
      encoding: UTF-8
      string: '{"payments":{"amount":1155,"currency":"GBP","links":{"mandate":"MD0000PSV8N7FR"},"metadata":{"customer_id":"CU0000RR39FMVB"},"charge_date":"2016-06-20"}}'
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: Created
    headers:
      Date:
      - Tue, 14 Jun 2016 23:49:52 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=dc3263acabc968c64b983d42705c09daf1465948192; expires=Wed, 14-Jun-17
        23:49:52 GMT; path=/; domain=.gocardless.com; HttpOnly
      Location:
      - https://api-sandbox.gocardless.com/payments/PM0001DZFV8MSG
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"2bd631b6b64b6e7934e1aa00bcee5fbc"
      X-Request-Id:
      - 12bee5e3-90a6-41d6-a002-463e60d0af67
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '998'
      Ratelimit-Reset:
      - Tue, 14 Jun 2016 23:50:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2b31ae6bc2663518-LHR
    body:
      encoding: UTF-8
      string: '{"payments":{"id":"PM0001DZFV8MSG","created_at":"2016-06-14T23:49:52.691Z","charge_date":"2016-06-20","amount":1155,"description":null,"currency":"GBP","status":"pending_submission","amount_refunded":0,"reference":null,"metadata":{"customer_id":"CU0000RR39FMVB"},"links":{"mandate":"MD0000PSV8N7FR","creditor":"CR000045KKQEY8"}}}'
    http_version: 
  recorded_at: Tue, 14 Jun 2016 23:49:52 GMT
- request:
    method: get
    uri: https://api-sandbox.gocardless.com/customer_bank_accounts/BA0000P8MREF5F
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - gocardless_pro/v1.0.3 ruby/2.3.0p0 ruby/2.3.0 x86_64-linux faraday/0.9.1
      Gocardless-Version:
      - '2015-07-06'
      Content-Type:
      - application/json
      Authorization:
      - Bearer <gocardless_token>
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 14 Jun 2016 23:49:53 GMT
      Content-Type:
      - application/json
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=d7dd1e5e12cf812c2f81451715d373ef21465948193; expires=Wed, 14-Jun-17
        23:49:53 GMT; path=/; domain=.gocardless.com; HttpOnly
      Pragma:
      - no-cache
      Cache-Control:
      - no-store
      Etag:
      - W/"2c73e1d569064ff106e2377ed61d5700"
      X-Request-Id:
      - eb3b9c5b-99c4-4258-a1f9-fc17be7eba8c
      Vary:
      - Origin
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Strict-Transport-Security:
      - max-age=31536000; includeSubDomains; preload
      Ratelimit-Limit:
      - '1000'
      Ratelimit-Remaining:
      - '997'
      Ratelimit-Reset:
      - Tue, 14 Jun 2016 23:50:00 GMT
      Server:
      - cloudflare-nginx
      Cf-Ray:
      - 2b31ae737ab835c6-LHR
    body:
      encoding: ASCII-8BIT
      string: '{"customer_bank_accounts":{"id":"BA0000P8MREF5F","created_at":"2016-04-11T19:16:56.376Z","account_number_ending":"11","account_holder_name":"S
        SAMWELL","bank_name":"BARCLAYS BANK PLC","currency":"GBP","country_code":"GB","metadata":{},"enabled":true,"links":{"customer":"CU0000RR39FMVB"}}}'
    http_version: 
  recorded_at: Tue, 14 Jun 2016 23:49:53 GMT
recorded_with: VCR 3.0.0
